"""
Передвинуть четные числа вперед

Дан не отсортированный массив целых чисел.
Необходимо перенести в начало массива все четные числа, сохраняя их очередность.
То есть если 8 стояла после 2, то после переноса в начало, она по-прежнему
должна стоять после 2.

Пример ввода: [3, 2, 4, 1, 11, 8, 9]
Пример вывода: 2 4 8 1 11 3 9
"""


def even_first(arr):
    even_index = 0
    for i in range(len(arr)):
        if arr[i] % 2 == 0:
            arr[i], arr[even_index] = arr[even_index], arr[i]
            even_index += 1
    return arr


print(even_first([3, 2, 4, 1, 11, 8, 9]))
