"""
Нули в конец

В школе прошел экзамен по математике. Несколько человек списали решения и были
замечены. Этим школьникам поставили 0 баллов.

Задача: есть массив с оценками, среди которых есть 0. Необходимо все оценки,
равные нулю перенести в конец массива, чтобы все такие школьники оказались
в конце списка.

Пример ввода: [0, 0, 1, 0, 3, 12]
Пример вывода: [1, 3, 12, 0, 0, 0]
Пример ввода: [0, 33, 57, 88, 60, 0, 0, 80, 99]
Пример вывода: [33, 57, 88, 60, 80, 99, 0, 0, 0]
Пример ввода: [0, 0, 0, 18, 16, 0, 0, 77, 99]
Пример вывода: [18, 16, 77, 99, 0, 0, 0, 0, 0]
"""


def move_zeros(arr):
    j = 0
    for i in range(len(arr)):
        if arr[i] != 0:
            arr[i], arr[j] = arr[j], arr[i]
            j += 1
    return arr


print(move_zeros([0, 0, 1, 0, 3, 12]))
